app/controllers/todo_lists_controller.rb

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("list_name", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["list_name", "now?"], ["due_date", "{1=>2017, 2=>8, 3=>22}"], ["created_at", "2017-08-22 22:24:05.812559"], ["updated_at", "2017-08-22 22:24:05.812559"]]